#+TITLE: scratch 
#+DESCRIPTION: this file is to track miscs 
#+TODO: TODO | DONE
#+TODO: READY PROGRESS | COMP

* 长期目标 
** full-stack engineer 
[[file:org.org::*project scratch]]

* 短期目标
* spiritual life 

* workout 
** DONE writing a workout plan 
   CLOSED: [2017-01-02 Mon 06:14]
[[file:workout.org]]

* health
- going upstairs 3 times a day in office
** TODO 8 cups of water per day
** go to bed early ( 12:00 )
remember the lesson you learn 
** DONE rest well, recover from cold 

** TODO breakfast habit 
   SCHEDULED: <2017-02-07 Tue .+1d>
   - State "DONE"       from "TODO"       [2017-02-06 Mon 10:23]
   - State "DONE"       from "TODO"       [2017-02-03 Fri 12:07]
   - State "DONE"       from "TODO"       [2017-02-02 Thu 10:31]
   - State "DONE"       from "TODO"       [2017-02-01 Wed 17:26]
   - State "DONE"       from "TODO"       [2017-01-30 Mon 10:39]
   - State "DONE"       from "TODO"       [2017-01-27 Fri 21:19]
   - State "DONE"       from "TODO"       [2017-01-25 Wed 11:30]
   - State "DONE"       from "TODO"       [2017-01-24 Tue 10:35]
   - State "DONE"       from "TODO"       [2017-01-23 Mon 18:06]
   - State "DONE"       from "TODO"       [2017-01-19 Thu 13:25]
   - State "DONE"       from "TODO"       [2017-01-15 Sun 19:47]
   - State "DONE"       from "TODO"       [2017-01-14 Sat 22:07]
   - State "DONE"       from "TODO"       [2017-01-11 Wed 10:55]
   - State "DONE"       from "TODO"       [2017-01-09 Mon 11:57]
   - State "DONE"       from "TODO"       [2017-01-04 Wed 15:01]
   - State "DONE"       from "TODO"       [2017-01-03 Tue 11:23]
   - State "DONE"       from "TODO"       [2016-12-30 Fri 20:37]
   - State "DONE"       from "TODO"       [2016-12-22 Thu 17:16]
   - State "DONE"       from "TODO"       [2016-12-16 Fri 10:44]
   - State "DONE"       from "TODO"       [2016-12-14 Wed 10:39]
   - State "DONE"       from "TODO"       [2016-12-09 Fri 17:31]
   - State "DONE"       from "TODO"       [2016-12-08 Thu 09:51]
   - State "DONE"       from "TODO"       [2016-11-08 Tue 11:15]
   - State "DONE"       from "TODO"       [2016-11-07 Mon 09:39]
   - State "DONE"       from "TODO"       [2016-11-01 Tue 14:04]
   - State "DONE"       from "TODO"       [2016-10-31 Mon 11:18]
   - State "DONE"       from "TODO"       [2016-10-27 Thu 15:07]
   - State "DONE"       from "TODO"       [2016-10-26 Wed 10:24]
   - State "DONE"       from "TODO"       [2016-10-25 Tue 10:06]
   - State "DONE"       from "TODO"       [2016-10-24 Mon 10:43]
   - State "DONE"       from "TODO"       [2016-10-21 Fri 11:02]
   - State "DONE"       from "TODO"       [2016-10-20 Thu 16:44]
   - State "DONE"       from "TODO"       [2016-10-19 Wed 10:42]
   - State "DONE"       from "TODO"       [2016-10-18 Tue 11:01]
   - State "DONE"       from "TODO"       [2016-10-17 Mon 10:34]
   - State "DONE"       from "TODO"       [2016-10-14 Fri 14:11]
   - State "DONE"       from "TODO"       [2016-10-13 Thu 10:20]
   - State "DONE"       from "TODO"       [2016-10-12 Wed 11:11]
   - State "DONE"       from "TODO"       [2016-10-11 Tue 10:37]
   - State "DONE"       from "TODO"       [2016-10-10 Mon 10:19]
   - State "DONE"       from "TODO"       [2016-10-07 Fri 10:55]
   - State "DONE"       from "TODO"       [2016-10-06 Thu 10:55]
   - State "DONE"       from "TODO"       [2016-10-05 Wed 11:16]
   - State "DONE"       from "TODO"       [2016-10-04 Tue 12:07]
   - State "DONE"       from "TODO"       [2016-10-03 Mon 15:28]
   - State "DONE"       from "PROGRESS"   [2016-09-30 Fri 16:36]
   - State "DONE"       from "PROGRESS"   [2016-09-28 Wed 22:57]
   :PROPERTIES:
   :STYLE:    habit
   :LAST_REPEAT: [2017-02-06 Mon 10:23]
   :END:
- starch, protein 
- eat before going to work 

*** the menu
in office 
- cereal with milk
- hot cereal w/ milk + banana
- sandwich with ham/ sausage 
- fruit after breakfast. apple/banana 

on the road 
- juice 
- cookie





* career
** TODO interview preparation


* thoughts 
- 最近浪费时间浪费的太多了。 基本上周末都在玩游戏中度过了
- leetcode上的题目没有及时复习，要忘记光了
- 书也没有看。
- 没有健身，好像自从结婚以后人就懒掉了。
  - 设定一个健身计划
  - file:workout.org
- 写代码低级bug太多了。 
  - 看别人编写代码视频
- git hub all projects
- utilize stand desk 
- spent too long on gaming 

<2016-06-16 Thu>
- gaming too much
- sleep too late. really bad habit 
- m routine is good. not too many, keep it ! the rule is don't do it at night

<2016-06-29 Wed>
- should spent more time on online code practice 
- should write cleaner code. 
- utilize what you learn in daily programming 





** DONE [#A] set the goal for WORK every day. 
- drqs
- projects 
- next things to do
- work until 5:00 - 5:30 pm

** DONE spent 1 ~ 2 hours non work related projects.			:gtd:
- i.e. reading, self studying 



* emacs learning						 :move:emacs:
** PROGRESS learn lisp language
   - State "DONE"       from "PROGRESS"   [2016-09-12 Mon 17:57]
   - State "DONE"       from "PROGRESS"   [2016-09-08 Thu 16:06]
   :PROPERTIES:
   :LAST_REPEAT: [2016-09-12 Mon 17:57]
   :END:
https://www.gnu.org/software/emacs/manual/html_mono/eintr.html
[[http://ergoemacs.org/emacs/elisp_basics.html]]
*** DONE emacs sync online ? 
    CLOSED: [2016-05-02 Mon 22:03]
auto sync 

** org mode 
*** DONE get familar with org mode [6/6]
    - Note taken on [2016-05-02 Mon 15:50] \\
      including regular org mode operations
    CLOCK: [2016-05-02 Mon 15:38]--[2016-05-02 Mon 16:43] =>  1:05
    CLOCK: [2016-05-02 Mon 15:35]--[2016-05-02 Mon 15:36] =>  0:01
http://www.fuzihao.org/blog/2015/02/19/org-mode%E6%95%99%E7%A8%8B/
- [X] adding timestamps to closed todo 
- [X] adding links 
- [X] adding bookmarks 
- [X] todo management  
- [X] agenda view
- [X] org mode log a task 

*** DONE org mode links 
    CLOSED: [2016-04-25 Mon 23:30]
    
*** DONE table mode for emacs 
    CLOSED: [2016-04-28 Thu 18:04]
*** DONE create diary
    CLOSED: [2016-05-03 Tue 11:48]
- [X] create a journal
- [ ] create a diary template

*** DONE capture template 
    CLOSED: [2016-05-03 Tue 11:48]
*** PROGRESS planning & recording tasks 
    - Note taken on [2016-10-14 Fri 18:13] \\
      know how to use table to record the task
*** DONE learn emacs batch mode
    CLOSED: [2016-10-07 Fri 16:00]
*** COMP better looking org.
    CLOSED: [2016-10-05 Wed 15:02]
- [X] more striking headlines : another theme 


** DONE emacs code templating 
   CLOSED: [2016-05-21 Sat 23:18]
- choose a plugin
- adding simple templates

** magit tutorial 
*** DONE getting started 
    CLOSED: [2016-04-25 Mon 19:18]

*** DONE setting git on virtual machine 
    CLOSED: [2016-04-26 Tue 13:58]


** emacs lint 
*** DONE flycheck setting 

*** TODO set environment in work environment 
    
** emacs UML
*** TODO introduce UML to emacs 
- [X] image solution
- [ ] 


** emacs coding snippets
*** TODO create template for common language

** emacs shortcut 
*** DONE install emacs shortcut 
*** TODO install emacs window management 
    
** emacs helm mode 
*** DONE regular helm mode 
    CLOSED: [2016-04-28 Thu 17:31]


** emacs mode cheetsheet
| <11> mode name | <20> link            |
|----------------+----------------------|
| helm           |                      |
| org mode       |                      |
| magit          |                      |




** DONE emacs code re-factoring 

* self-improvement 
** TODO code refactoring tutorial				   :worktime:
   SCHEDULED: <2016-09-30 Fri ++1w>
   - State "DONE"       from "PROGRESS"   [2016-09-15 Thu 18:18]
   - State "DONE"       from "TODO"       [2016-07-22 Fri 16:45]
   - State "DONE"       from "TODO"       [2016-07-22 Fri 16:45]
   - State "DONE"       from "TODO"       [2016-07-22 Fri 16:45]
   - State "DONE"       from "TODO"       [2016-07-22 Fri 16:45]
   - State "DONE"       from "TODO"       [2016-07-01 Fri 16:19]
   - State "DONE"       from "TODO"       [2016-06-16 Thu 18:08]
   - State "DONE"       from "TODO"       [2016-06-09 Thu 18:53]
   - State "DONE"       from "TODO"       [2016-05-17 Tue 03:50]
   :PROPERTIES:
   :LAST_REPEAT: [2016-09-15 Thu 18:18]
   :END:
file:refactor.org





* Productivity
** DONE publish script to publish article
** TODO find a way to learn more in work 

** TODO [#B] mouse-less work flow

** TODO daily work work-flow

** TODO archive for org mode.
- make a emacs command 

* PET project thoughts						    :project:
** idea, automate everything. 
- what can be automated during work? 
- what can be done during daily work 
- what can be done to help boosting productivity
- what can be done to help better investment 

** stock tracker.
- depending on [[file:org.org::investment]]


** a email processor 
Analyze your email.


** communicate board with miaomiao


* learn new things 
** PROGRESS try out unit-test. 
   CLOCK: [2016-09-19 Mon 15:25]--[2016-09-19 Mon 16:51] =>  1:26
   CLOCK: [2016-08-22 Mon 18:00]--[2016-08-22 Mon 18:23] =>  0:23
- [X] test driven development 
- [ ] unit test for nodejs project

** DONE subscribe programming blogs
   CLOSED: [2016-08-18 Thu 23:19]
- coding horror 

* entertainment
** DONE create a music playlist
   DEADLINE: <2016-07-10 Sun>
   - Note taken on [2016-07-11 Mon 16:16] \\
     postpone 









** DONE install gtx 1070 and play
   CLOSED: [2016-09-15 Thu 00:55]



** DONE overclock the system.
- [X] resolve the driver issue. follow the steps
  - check disk: chkdsk C: /f /r /x
  - download the latest intel burn test
  - stock voltage. 
  - run with the max fan speed 
  - another power plan. 
  - check gpu voltage temp.
  - mem-test
  - switch the cord  
  - calculate the power consumption 
  - caused by overclock & unstable voltage 

- [X] overclock the system to stable 
  - [X] 4.2 ghz for now 
  - [X] 4.4 ghz is the goal 

- 4.2 g spec, 
  - adaptive core voltage: turbo 1.19v
  - cpu llc calibration set to 5
  - set up in bios 
  - cpu fan no extreme quiet mode
  - [X] prime 95
  - [X] intel extreme score: 

- 4.4 g spec
  - adaptive core voltage: turbo 1.19v
  - cpu llc calibration set to 5
  - [X] prime 95 1 night 
  - intel extreme score:

- notes
  - the max voltage should be < 1.3
  - llc calibration to avoid vdrop, otherwise can't reach 1.2 
  - should test prime95 blend ! otherwise memory may not be stable 

** TODO future cpu overclock
  - [X] testing in game in-game OSD
  - [ ] lower voltage 
  - [ ] to 4.5 ghz
    - 1.21 above ! otherwise the system is unstable 
  - [X] mem setting 
    - xmp 2.0  reaches 3000 mhz 

** DONE game list
   CLOSED: [2016-12-16 Fri 15:21]
writing down the games plan to play
- dark souls 3 
- total war warhammer
  - w/ new dlc 
- gta 5
- witcher 3 
- pillars of eternity 
- xcom 2
- ark
- metal gear solid 
- casual 
  - overwatch
  - league of legend 


I think it's better writing game journal/reviview
*** COMP gaming benchmark 
    CLOSED: [2016-10-17 Mon 17:10] SCHEDULED: <2016-10-05 Wed>
    - Note taken on [2016-10-17 Mon 17:09] \\
      conclusion: only Ark doesn't reach its full potential
    :PROPERTIES:
    :Effort:   30m
    :END:
- under nvidia default advanced setting
  let 3d application decides
- hwinfo + rivtuner does it affect the performance (test total war) 

- [X] total war: all ultra 100+ fps
- [X] witcher 3 : hair-work AA off, vsync off, large town 60+ fps
- [X] GTA  60+ fps



*** COMP setting up config for ark 
    CLOSED: [2016-10-07 Fri 12:13] SCHEDULED: <2016-10-03 Mon>
    - Note taken on [2016-10-04 Tue 13:01] \\
      after first try, everything seems fine. but the fps doesn't change a lot
this is good game to play with miaomiao. 
- [X] benchmark. 
  - cpu, freq 1-4, temp 1-4, utilization 1-4 
  - gpu, freq, temp. utilization, gpu mem, freq 
  - mem, usage. 
- setting 
  - [X] resolution scaling should be 100 %
  - [X] disable the audio
  - [X] nvidia panel setting to default: let's try let 3d app decide
  - [X] tweak nvidia panel
  - [X] try board-less 

** gaming goals 
*** Ark.
**** DONE writing notes in game 
     CLOSED: [2016-10-31 Mon 15:21]
- build raft 
- explore other places 
- new colony.

* INBOX 
** COMP eBay sell items  
   CLOSED: [2016-10-05 Wed 11:19]
** DONE call python script in emacs?  
   CLOSED: [2017-01-02 Mon 05:28]
** TODO things you r interested in.  
** PROGRESS record time 
- recording daily time spent on website
- weekly analysis 
- give reports 
- migrate this item to habit 

** DONE discuss with miaomiao what to do next 
   CLOSED: [2016-12-16 Fri 16:28]
** TODO create a menu list 
- adding menu to the web 



** DONE message push system 
   CLOSED: [2017-01-02 Mon 05:28]


** DONE back to work plan 
   CLOSED: [2016-12-22 Thu 12:08]

** DONE jiff 
   CLOSED: [2016-10-31 Mon 13:09] DEADLINE: <2016-10-28 Fri>

** DONE [#A] writing eval 
   CLOSED: [2016-11-01 Tue 10:36] SCHEDULED: <2016-10-28 Fri>
** TODO [#A] baby schedule 
